[
    {
        "activity": "Member of GDSC NITS (2023-24)",
        "desc": "Being a part of GDSC NITS gave me the opportunity to develop my tech as well as non-tech skills at the same time."
    },
    {
        "activity": "Member of ECS NITS (2023-24)",
        "desc": "Contributing something towards my branch society of ECE was something I had dreamt of right from my freshmen year. Conducting numerous events, workshops, developing the website etc were some of the things which gave me everlasting memories."
    },
    {
        "activity": "Content writer at POSUA",
        "desc": "To be honest, I did'nt have any prior knowledge of content writing. All I wanted was a medium to keep my habit of writing in my mother tongue Assamese, which is normally not easy to follow given that the course materials and everything of engineering are based only upon English. Posua's content team surely helped me to stay in touch with my mother tongue while also teaching me a new skill."
    },
    {
        "activity": "QUIZ Club NITS",
        "desc": "Quizzing had been a hobby since my school days. During the later part though, I had somewhat lost the practice of regular quizzing due to JEE preparation and all. QUIZ Club NITS actually helped me revive that lost habit of quizzing. Moreover, it also made me capable of actually preparing the question sets and hosting quizzes."
    },
    {
        "activity": "Other Activities",
        "desc": "Besides all these, there are certain other activities I have done in my college. Participating in hackathons is one of them. Also, during my first year I participated in an Assamese poem recitation competition. Besides that, I have a great interest in singing. I performed in a few events including branch freshers, few farewells and many more. I have focused on exploring various activities going on inside my college. Overall, I have enjoyed the first two years of my college life. Hoping to continue this streak for the final two years too."
    }
]